Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
average_pooling1d (AveragePo (None, 296, 1)            0         
_________________________________________________________________
conv1d (Conv1D)              (None, 147, 32)           160       
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 72, 32)            4128      
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 35, 32)            4128      
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 16, 32)            4128      
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 7, 32)             4128      
_________________________________________________________________
flatten (Flatten)            (None, 224)               0         
_________________________________________________________________
dense (Dense)                (None, 1)                 225       
=================================================================
Total params: 16,897
Trainable params: 16,897
Non-trainable params: 0
_________________________________________________________________
0.9984 0.0045 0.9982 0.0052