Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
average_pooling1d (AveragePo (None, 296, 1)            0         
_________________________________________________________________
conv1d (Conv1D)              (None, 293, 32)           160       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 146, 32)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 143, 32)           4128      
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 71, 32)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 68, 32)            4128      
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 34, 32)            0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 31, 32)            4128      
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 15, 32)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 12, 32)            4128      
_________________________________________________________________
global_max_pooling1d (Global (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 33        
=================================================================
Total params: 16,705
Trainable params: 16,705
Non-trainable params: 0
_________________________________________________________________
0.9996 0.0013 0.9969 0.0098